![](https://user-images.githubusercontent.com/83436724/166116197-cbe1a8bc-e1df-4cac-ad5e-9f6cd9f0f43c.png)

## Obtener datos haciendo uso de SQL

#### Obtener datos desde bases de datos relacionales

#### Autor: Carlos Adrián Alarcón [Socials](https://linktr.ee/aladelca)

La mayor parte de los datos internos o transaccionales de una organización se encuentra en bases de datos relacionales. El lenguaje para consultar estas bases de datos es ``SQL`` (Structured Query Language). Este lenguaje es transversal a diversos gestores de bases de datos. A continuación, se presentan algunos ejemplos de gestores de bases de datos:

* Microsoft SQL Server
* Oracle PL-SQL
* MySQL
* SQLite

A continuación, revisaremos los principales conceptos para consultar datos y crear objetos en bases de datos relacionales

Para utilizar SQL en un notebook, vamos a utilizar `ipython-sql`. Lo vamos a importar a continuación.

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Para el caso actual, se utilizará el caso Banco Tu Gente, que tiene las siguientes reglas de negocio:

* Un cliente puede tener varios productos
* Un producto solamente puede ser abierto en una sede (Banca Virtual también califica como sede)

El modelo de datos se muestra a continuación

![](https://user-images.githubusercontent.com/83436724/169954486-f3bca4d7-9a6b-43aa-8c0c-c8d72d0455f1.png)

El lenguaje SQL tiene diversos tipos. Se tiene el DML (Data Manipulation Language), que sirve para hacer modificaciones y consultas a los datos. También existe el DDL (Data Definition Language), que está más enfocado en la creación de objetos dentro de la base de datos. Finalmente, el DCL (Data Control Language), que está enfocado en la gestión de seguridad y permisos

![](https://user-images.githubusercontent.com/83436724/169954978-458ee02b-ab36-4d90-b29f-06587c2ba2dd.png)

#### Creación de modelo de datos

Vamos a crear la base de datos del banco **Tu Gente**

In [34]:
%sql sqlite:///banco_tugente.db

Ahora nos toca crear las tablas asociadas: ``Clientes``, ``Productos`` y ``Sede``

Iniciaremos con la tabla ``Clientes``

In [35]:
%%sql
CREATE TABLE Clientes
(
    idCliente INT PRIMARY KEY,
    nombreCliente VARCHAR(50),
    apellidoCliente VARCHAR(50),
    correo VARCHAR(50),
    telefono VARCHAR(50)
)

   sqlite:///banco.db
 * sqlite:///banco_tugente.db
(sqlite3.OperationalError) table Clientes already exists
[SQL: CREATE TABLE Clientes (
    idCliente INT PRIMARY KEY,
    nombreCliente VARCHAR(50),
    apellidoCliente VARCHAR(50),
    correo VARCHAR(50),
    telefono VARCHAR(50)
)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

``Sede``

In [32]:
%%sql

CREATE TABLE Sede
(
    idSede INT PRIMARY KEY,
    nombreSede VARCHAR(100),
    pais VARCHAR(50),
    departamento VARCHAR(50),
    provincia VARCHAR(50),
    distrito VARCHAR(100)

)

 * sqlite:///banco.db
   sqlite:///banco_tugente.db
Done.

[]

``Productos``

In [33]:
%%sql

CREATE TABLE Productos
(
    idProducto INT PRIMARY KEY,
    idCliente INT,
    idSede INT,
    nombreProducto VARCHAR(100),
    tipoProducto VARCHAR(50),
    tasaInteres FLOAT, 
    montoActual FLOAT,
    FOREIGN KEY (idCliente) REFERENCES Clientes(idCliente),
    FOREIGN KEY (idSede) REFERENCES Sede(idSede)

)

 * sqlite:///banco.db
   sqlite:///banco_tugente.db
Done.

[]

Ahora, insertaremos datos a cada una de las tablas. Para insertar tablas, se usa la siguiente notación:
```SQL
INSERT INTO <Nombre Tabla> VALUES (<atributos>)
```

In [16]:

%%sql
INSERT INTO Clientes
VALUES 
(1, 'Carlos Adrian','Alarcon Delgado','alarcon.adrianc@gmail.com', '934-678-2342'),
(2, 'Jose Maria','Rodriguez Quevedo', 'jrodriguez@hotmail.com', '9824392-12'),
(3, 'Maria','Quispe', 'jrodriguez@hotmail.com', '9824392-12'),
(4, 'Eliana','Arevalo', NULL, NULL),
(5, 'Patrick',NULL, 'pguevara@hotmail.com', NULL),
(6, 'Maria Elena',NULL, 'mariaquevedo@tumail.com', '4242212'),
(7, 'Marian','Millones', 'MILLONES@hotmail.com', 'AB46343'),
(8, 'Mariana','Duarte', 'duartema@gmail.com', '4232536'),
(9, 'Anamariana','Solis', 'asolis@yahoo.com', NULL),
(10, 'Jorge','Cabezudo', '', '')

 * sqlite:///banco_tugente.db
10 rows affected.

[]

A continuación, rellenaremos las siguientes tablas

In [18]:
%%sql

INSERT INTO Sede
VALUES
(1,'Sede Central','PE','Lima','Lima','Lima'),
(2,'Banca Virtual','PE',NULL,NULL,NULL),
(3,'Norteamerica','MX',NULL,NULL,NULL),
(4,'Internacional','CO',NULL,NULL,NULL)

 * sqlite:///banco_tugente.db
4 rows affected.

[]

In [21]:
%%sql

INSERT INTO Productos
VALUES
(1,2,1,'Cuenta Millonaria','Ahorros',2.60,10000.23),
(2,2,2,'Prestamo Fácil','Prestamo',45.3,50000),
(3,7,3,'Cuenta Jubilacion','Ahorros',5.5,40004.53),
(4,10,4,'Cuenta Millonaria','Ahorros',7.5,23252392.90),
(5,9,2,'Cuenta Digital','Ahorros',15.6,7000023.43)

 * sqlite:///banco_tugente.db
5 rows affected.

[]

#### Consultas básicas SQL

La forma básica de una consulta SQL es:

```SQL
SELECT <atributos>
FROM <tablas>
WHERE <condiciones>
```

In [36]:
%%sql

SELECT
*
from
Productos

   sqlite:///banco.db
 * sqlite:///banco_tugente.db
Done.

[(1, 2, 1, 'Cuenta Millonaria', 'Ahorros', 2.6, 10000.23),
 (2, 2, 2, 'Prestamo Fácil', 'Prestamo', 45.3, 50000.0),
 (3, 7, 3, 'Cuenta Jubilacion', 'Ahorros', 5.5, 40004.53),
 (4, 10, 4, 'Cuenta Millonaria', 'Ahorros', 7.5, 23252392.9),
 (5, 9, 2, 'Cuenta Digital', 'Ahorros', 15.6, 7000023.43)]

In [25]:
%%sql

SELECT
*
from
Clientes
WHERE 
idCliente > 5

 * sqlite:///banco_tugente.db
Done.

[(6, 'Maria Elena', None, 'mariaquevedo@tumail.com', '4242212'),
 (7, 'Marian', 'Millones', 'MILLONES@hotmail.com', 'AB46343'),
 (8, 'Mariana', 'Duarte', 'duartema@gmail.com', '4232536'),
 (9, 'Anamariana', 'Solis', 'asolis@yahoo.com', None),
 (10, 'Jorge', 'Cabezudo', '', '')]

También se pueden hacer uso de operadores como ``LIKE``

In [29]:
%%sql

SELECT
idCliente,
nombreCliente,
apellidoCliente
from
Clientes
WHERE
nombreCliente LIKE '%Maria%'

 * sqlite:///banco_tugente.db
Done.

[(2, 'Jose Maria', 'Rodriguez Quevedo'),
 (3, 'Maria', 'Quispe'),
 (6, 'Maria Elena', None),
 (7, 'Marian', 'Millones'),
 (8, 'Mariana', 'Duarte'),
 (9, 'Anamariana', 'Solis')]

Hay varias operadores que uno puede utilizar en el `WHERE`. Destacamos los siguientes:

- `=, != (o <>)`
- `<, >, <=, >=`
- `AND, OR, NOT`
- `BETWEEN`, cuyo formato es: 
```SQL
<atributo> BETWEEN <valor1> AND <valor2>
```
Esta condición es cierta si `<atributo>` está entre los valores `<valor1>` y `<valor2>` (inclusive). 
- `IN`, cuyo formato es:
```SQL
<atributo> IN (<valor1>, <valor2>,...)
```
Esta condición es cierta si `<atributo>` está en la lista de valores 
`(<valor1>, <valor2>,...)`
- `NOT IN`, cuyo formato es:
```SQL
<atributo> NOT IN (<valor1>, <valor2>,...)
```
Esta condición es cierta si `<atributo>` no está en la lista de valores 
`(<valor1>, <valor2>,...)`
- `LIKE`, cuyo formato es:
```SQL
<atributo_string> LIKE <expresion>
```
Esta condición es cierta si `<atributo_string>`, el cual es del tipo `string`, tiene la forma de `<expresion>`. En `<expresion>` uno puede poner letras y keywords como `%` el cual indica que hay una palabra de cualquier largo o `_` el cual indica que hay una letra. Por ejemplo `<nombre> LIKE '%Juan%'` es cierto si el string `<nombre>` contiene la palabra 'Juan'. La condición `<nombre> LIKE 'Juan%'` sería cierto si `<nombre>` empieza con la palabra 'Juan'. La condición `<sigla> LIKE 'CL_'` indica que `<sigla>` tiene 3 letras y las dos primeras deben ser `CL` (la última puede ser cualquiera). 

Los keywords `IN` y `NOT IN` nos servirán también para hacer subsconsultas como veremos más adelante.

#### JOINS

Los JOINS sirven para cruzar datos y generar consultas de diversas tablas. Para entender un poco más acerca de cómo usar los JOINS, haremos uso de la siguiente imagen:

![](https://user-images.githubusercontent.com/83436724/169961746-b028dc26-ca4e-4da0-b037-c2785bb9d2c4.jpg)

La forma básica de un JOIN es:

```SQL
SELECT 
<atributos>
FROM 
<tabla izquierda> 
<tipo> JOIN 
<tabla izquierda> 
ON <llave tabla izquierda> = <llave tabla derecha>
```

A continuación, generaremos una consulta que nos traiga los productos y los clientes

In [38]:
%%sql

SELECT
idProducto,
nombreProducto,
tipoProducto,
montoActual,
nombreCliente,
apellidoCliente
FROM
Productos A
INNER JOIN
Clientes B
ON A.idCliente = B.idCliente

   sqlite:///banco.db
 * sqlite:///banco_tugente.db
Done.

[(1, 'Cuenta Millonaria', 'Ahorros', 10000.23, 'Jose Maria', 'Rodriguez Quevedo'),
 (2, 'Prestamo Fácil', 'Prestamo', 50000.0, 'Jose Maria', 'Rodriguez Quevedo'),
 (3, 'Cuenta Jubilacion', 'Ahorros', 40004.53, 'Marian', 'Millones'),
 (4, 'Cuenta Millonaria', 'Ahorros', 23252392.9, 'Jorge', 'Cabezudo'),
 (5, 'Cuenta Digital', 'Ahorros', 7000023.43, 'Anamariana', 'Solis')]

In [42]:
%%sql

SELECT
idProducto,
nombreProducto,
tipoProducto,
montoActual,
nombreCliente,
apellidoCliente
FROM
Clientes A
LEFT JOIN
Productos B
ON A.idCliente = B.idCliente

   sqlite:///banco.db
 * sqlite:///banco_tugente.db
Done.

[(None, None, None, None, 'Carlos Adrian', 'Alarcon Delgado'),
 (1, 'Cuenta Millonaria', 'Ahorros', 10000.23, 'Jose Maria', 'Rodriguez Quevedo'),
 (2, 'Prestamo Fácil', 'Prestamo', 50000.0, 'Jose Maria', 'Rodriguez Quevedo'),
 (None, None, None, None, 'Maria', 'Quispe'),
 (None, None, None, None, 'Eliana', 'Arevalo'),
 (None, None, None, None, 'Patrick', None),
 (None, None, None, None, 'Maria Elena', None),
 (3, 'Cuenta Jubilacion', 'Ahorros', 40004.53, 'Marian', 'Millones'),
 (None, None, None, None, 'Mariana', 'Duarte'),
 (5, 'Cuenta Digital', 'Ahorros', 7000023.43, 'Anamariana', 'Solis'),
 (4, 'Cuenta Millonaria', 'Ahorros', 23252392.9, 'Jorge', 'Cabezudo')]

#### Agregaciones

Las agregaciones son útiles para poder resumir datos haciendo uso de algunos cálculos escalares. Las principales funciones de agregación son:

* ``COUNT`` : Recuendo de filas, no considera nulos
* ``AVG`` : Calcula el promedio
* ``SUM`` : Calcula la suma
* ``MAX`` : Calcula el máximo valor
* ``MIN`` : Calcula el mínimo valor

La estructura básica de las agregaciones es:

```SQL
SELECT 
<atributos>,
<funcion agregacion>
FROM 
<tablas> 
GROUP BY 
<atributos>
```

In [46]:
%%sql

SELECT
MAX(montoActual) as montoMaximo,
MIN(montoActual) as montoMinimo,
AVG(montoActual) as montoPromedio
FROM
Productos

   sqlite:///banco.db
 * sqlite:///banco_tugente.db
Done.

[(23252392.9, 10000.23, 6070484.218)]

In [48]:
%%sql
SELECT
tipoProducto,
AVG(montoActual) as montoPromedio,
MAX(montoActual) as montoMaximo
FROM
Productos
GROUP BY 
tipoProducto

   sqlite:///banco.db
 * sqlite:///banco_tugente.db
Done.

[('Ahorros', 7575605.2725, 23252392.9), ('Prestamo', 50000.0, 50000.0)]